wrk/futures_res/wrk_get.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.667ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.034ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.794ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.659ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms    1.22ms  26.18ms   97.53%
    Req/Sec     1.11k   683.12     5.44k    64.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.36ms
 90.000%    1.62ms
 99.000%    6.19ms
 99.900%   18.09ms
 99.990%   22.83ms
 99.999%   24.82ms
100.000%   26.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.239     0.000000            1         1.00
       0.597     0.100000         7867         1.11
       0.746     0.200000        15730         1.25
       0.870     0.300000        23644         1.43
       0.987     0.400000        31499         1.67
       1.098     0.500000        39318         2.00
       1.152     0.550000        43288         2.22
       1.203     0.600000        47218         2.50
       1.255     0.650000        51140         2.86
       1.309     0.700000        55052         3.33
       1.363     0.750000        58968         4.00
       1.394     0.775000        60925         4.44
       1.428     0.800000        62887         5.00
       1.466     0.825000        64864         5.71
       1.508     0.850000        66818         6.67
       1.558     0.875000        68794         8.00
       1.587     0.887500        69760         8.89
       1.618     0.900000        70753        10.00
       1.656     0.912500        71719        11.43
       1.704     0.925000        72718        13.33
       1.767     0.937500        73690        16.00
       1.804     0.943750        74176        17.78
       1.857     0.950000        74672        20.00
       1.925     0.956250        75157        22.86
       2.020     0.962500        75647        26.67
       2.175     0.968750        76146        32.00
       2.283     0.971875        76386        35.56
       2.441     0.975000        76633        40.00
       2.665     0.978125        76875        45.71
       3.175     0.981250        77121        53.33
       3.957     0.984375        77366        64.00
       4.475     0.985938        77489        71.11
       5.135     0.987500        77613        80.00
       5.871     0.989062        77735        91.43
       6.503     0.990625        77858       106.67
       7.315     0.992188        77980       128.00
       7.835     0.992969        78042       142.22
       8.431     0.993750        78104       160.00
       9.079     0.994531        78165       182.86
      10.167     0.995313        78226       213.33
      11.511     0.996094        78287       256.00
      12.399     0.996484        78318       284.44
      13.239     0.996875        78349       320.00
      14.391     0.997266        78380       365.71
      15.255     0.997656        78410       426.67
      15.999     0.998047        78441       512.00
      16.463     0.998242        78456       568.89
      16.687     0.998437        78472       640.00
      17.151     0.998633        78487       731.43
      17.679     0.998828        78502       853.33
      18.127     0.999023        78518      1024.00
      18.591     0.999121        78525      1137.78
      18.895     0.999219        78533      1280.00
      19.375     0.999316        78541      1462.86
      19.631     0.999414        78548      1706.67
      20.127     0.999512        78556      2048.00
      20.303     0.999561        78560      2275.56
      20.479     0.999609        78564      2560.00
      20.687     0.999658        78568      2925.71
      20.783     0.999707        78571      3413.33
      21.359     0.999756        78575      4096.00
      21.647     0.999780        78577      4551.11
      21.871     0.999805        78579      5120.00
      21.967     0.999829        78581      5851.43
      22.479     0.999854        78583      6826.67
      22.575     0.999878        78585      8192.00
      22.831     0.999890        78586      9102.22
      22.959     0.999902        78587     10240.00
      22.975     0.999915        78588     11702.86
      23.151     0.999927        78589     13653.33
      23.999     0.999939        78590     16384.00
      23.999     0.999945        78590     18204.44
      24.047     0.999951        78591     20480.00
      24.047     0.999957        78591     23405.71
      24.671     0.999963        78592     27306.67
      24.671     0.999969        78592     32768.00
      24.671     0.999973        78592     36408.89
      24.815     0.999976        78593     40960.00
      24.815     0.999979        78593     46811.43
      24.815     0.999982        78593     54613.33
      24.815     0.999985        78593     65536.00
      24.815     0.999986        78593     72817.78
      26.191     0.999988        78594     81920.00
      26.191     1.000000        78594          inf
#[Mean    =        1.229, StdDeviation   =        1.224]
#[Max     =       26.176, Total count    =        78594]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  145893 requests in 30.00s, 9.28MB read
  Socket errors: connect 7, read 0, write 0, timeout 7057
  Non-2xx or 3xx responses: 106
Requests/sec:   4863.75
Transfer/sec:    316.83KB